#Создать строку равную третьему символу введенной строки.

stroka = str(input())

b = stroka[3]
print(b)
